[Killed] ArrowFunction
main/components/Commons/ManageCows.js:10:38
   const [numOfCowsToBuy, setNumOfCowsToBuy] = useState(2);
   const handleBuyHerdModalClose = () => setShowBuyHerdModal(false);
   const handleBuyHerdModalShow = () => setShowBuyHerdModal(true);
-  const handleNumOfCowsToBuyChange = (event) => setNumOfCowsToBuy(parseInt(event.target.value));
+  const handleNumOfCowsToBuyChange = () => undefined;
   const handleBuyHerd = () => {
     //Stryker disable-next-line all
killedBy: ManageCows tests buying a herd of cows
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "5"
Received: "2"

[Killed] BlockStatement
main/components/Commons/ManageCows.js:11:31
   const handleBuyHerdModalClose = () => setShowBuyHerdModal(false);
   const handleBuyHerdModalShow = () => setShowBuyHerdModal(true);
   const handleNumOfCowsToBuyChange = (event) => setNumOfCowsToBuy(parseInt(event.target.value));
-  const handleBuyHerd = () => {
-    //Stryker disable-next-line all
-    onBuy({ ...userCommons, numOfCowsToBuy });
-    handleBuyHerdModalClose();
-  };
+  const handleBuyHerd = () => {};
 
   return (
killedBy: ManageCows tests buying a herd of cows
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body

[Killed] BlockStatement
main/components/Commons/ManageCows.js:41:30
             <br />
             <Button
               variant="outline-danger"
-              onClick={() => {
-                //Stryker disable-next-line all
-                onBuy({ ...userCommons, numOfCowsToBuy:1 });
-              }}
+              onClick={() => {}}
               data-testid={"buy-cow-button"}
             >
killedBy: ManageCows tests buying and selling a cow
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ArithmeticOperator
main/components/Commons/ManageCows.js:80:24
                 data-testid={"buyHerdForm"}
               />
             </Form.Group>
-            <p>Cost: ${numOfCowsToBuy * commons?.cowPrice}</p>
+            <p>Cost: ${numOfCowsToBuy / commons?.cowPrice}</p>
           </Modal.Body>
           <Modal.Footer>
killedBy: ManageCows tests buying a herd of cows
statusReason: TestingLibraryElementError: Unable to find an element with the text: Cost: $60. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] OptionalChaining
main/components/Commons/ManageCows.js:80:41
                 data-testid={"buyHerdForm"}
               />
             </Form.Group>
-            <p>Cost: ${numOfCowsToBuy * commons?.cowPrice}</p>
+            <p>Cost: ${numOfCowsToBuy * commons.cowPrice}</p>
           </Modal.Body>
           <Modal.Footer>
killedBy: ManageCows tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'cowPrice')
