[Killed] BlockStatement
main/components/Users/UsersTable.js:33:47
     },
 ];
 
-export default function UsersTable({ users }) {
-    return <OurTable
-        data={users && users.map(user => {
-            return {
-                ...user, 
-                lastOnline: formatTime(user.lastOnline),
-            };
-        })}
-        columns={columns}
-        testid={"UsersTable"} />;
-};
+export default function UsersTable({ users }) {};
killedBy: UserTable tests renders without crashing for empty table
statusReason: Error: UsersTable(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:35:15
 
 export default function UsersTable({ users }) {
     return <OurTable
-        data={users && users.map(user => {
-            return {
-                ...user, 
-                lastOnline: formatTime(user.lastOnline),
-            };
-        })}
+        data={true}
         columns={columns}
         testid={"UsersTable"} />;
killedBy: UserTable tests renders without crashing for empty table
statusReason: TypeError: data.forEach is not a function

[Killed] BlockStatement
main/components/Users/UsersTable.js:35:42
 
 export default function UsersTable({ users }) {
     return <OurTable
-        data={users && users.map(user => {
-            return {
-                ...user, 
-                lastOnline: formatTime(user.lastOnline),
-            };
-        })}
+        data={users && users.map(user => {})}
         columns={columns}
         testid={"UsersTable"} />;
killedBy: AdminUsersPage tests renders without crashing on two users
statusReason: TypeError: Cannot read properties of undefined (reading 'subRows')

[Killed] ObjectLiteral
main/components/Users/UsersTable.js:36:20
 export default function UsersTable({ users }) {
     return <OurTable
         data={users && users.map(user => {
-            return {
-                ...user, 
-                lastOnline: formatTime(user.lastOnline),
-            };
+            return {};
         })}
         columns={columns}
killedBy: UserTable tests Has the expected colum headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:
