[Killed] LogicalOperator
main/components/Commons/CommonsOverview.js:11:30
     let navigate = useNavigate();
     // Stryker disable next-line all
     const leaderboardButtonClick = () => { navigate("/leaderboard/" + commons.id) };
-    const showLeaderboard = (hasRole(currentUser, "ROLE_ADMIN") || commons.showLeaderboard );
+    const showLeaderboard = (hasRole(currentUser, "ROLE_ADMIN") && commons.showLeaderboard );
     return (
         <Card data-testid="CommonsOverview">
killedBy: CommonsOverview tests Redirects to the LeaderboardPage for an admin when you click visit
statusReason: Error: Unable to find an element by: [data-testid="user-leaderboard-button"]

<body>
  <div>
    <div
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >
      <div

[Killed] ConditionalExpression
main/components/Commons/CommonsOverview.js:11:30
     let navigate = useNavigate();
     // Stryker disable next-line all
     const leaderboardButtonClick = () => { navigate("/leaderboard/" + commons.id) };
-    const showLeaderboard = (hasRole(currentUser, "ROLE_ADMIN") || commons.showLeaderboard );
+    const showLeaderboard = (true );
     return (
         <Card data-testid="CommonsOverview">
killedBy: CommonsOverview tests No LeaderboardPage for an ordinary user when commons has showLeaderboard = false
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
main/components/Commons/CommonsOverview.js:22:26
                         <Card.Text>Total Players: {commons.totalPlayers}</Card.Text>
                     </Col>
                     <Col>
-                        {showLeaderboard &&
-                        (<Button variant="outline-success" data-testid="user-leaderboard-button" onClick={leaderboardButtonClick}>
-                            Leaderboard
-                        </Button>)}
+                        {false}
                     </Col>
                 </Row>
killedBy: CommonsOverview tests Redirects to the LeaderboardPage for an admin when you click visit
statusReason: Error: Unable to find an element by: [data-testid="user-leaderboard-button"]

<body>
  <div>
    <div
      style="background-size: cover; background-image: url(PlayPageBackground.png);"
    >
      <div
