[Killed] ArithmeticOperator
main/components/Commons/FarmStats.js:7:39
 import Cash from "./../../../assets/Cash.png";
 
 const FarmStats = ({ userCommons }) => {
-  const cowHealthPercent = Math.round(userCommons.cowHealth * 100 / 100);
+  const cowHealthPercent = Math.round(userCommons.cowHealth / 100 / 100);
 
   return (
killedBy: FarmStats tests contains correct content
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Cow health: 98%/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] ArithmeticOperator
main/components/Commons/FarmStats.js:7:39
 import Cash from "./../../../assets/Cash.png";
 
 const FarmStats = ({ userCommons }) => {
-  const cowHealthPercent = Math.round(userCommons.cowHealth * 100 / 100);
+  const cowHealthPercent = Math.round(userCommons.cowHealth * 100 * 100);
 
   return (
killedBy: FarmStats tests contains correct content
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Cow health: 98%/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card"
    >
      <h5
