[Killed] BooleanLiteral
main/components/Commons/ManageCows.js:6:60
 import cowHead from "./../../../assets/CowHead.png";
 
 const ManageCows = ({ userCommons, commons, onBuy, onSell }) => {
-  const [showBuyHerdModal, setShowBuyHerdModal] = useState(false);
+  const [showBuyHerdModal, setShowBuyHerdModal] = useState(true);
   const [numOfCowsToBuy, setNumOfCowsToBuy] = useState(2);
   const handleBuyHerdModalClose = () => setShowBuyHerdModal(false);
killedBy: ManageCows tests closemodal test
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <label class="form-label">How many cows do you want to buy?</label> instead

<html>
  <head />
  <body
    class="modal-open"

[Killed] BooleanLiteral
main/components/Commons/ManageCows.js:8:61
 const ManageCows = ({ userCommons, commons, onBuy, onSell }) => {
   const [showBuyHerdModal, setShowBuyHerdModal] = useState(false);
   const [numOfCowsToBuy, setNumOfCowsToBuy] = useState(2);
-  const handleBuyHerdModalClose = () => setShowBuyHerdModal(false);
+  const handleBuyHerdModalClose = () => setShowBuyHerdModal(true);
   const handleBuyHerdModalShow = () => setShowBuyHerdModal(true);
   const handleNumOfCowsToBuyChange = (event) => {
killedBy: ManageCows tests buying a herd of cows
statusReason: Error: expect(received).toBeNull()

Received: <input class="form-control" data-testid="buyHerdForm" min="2" type="number" value="5" />

<html>
  <head />
  <body
    class="modal-open"

[Killed] ArrowFunction
main/components/Commons/ManageCows.js:8:35
 const ManageCows = ({ userCommons, commons, onBuy, onSell }) => {
   const [showBuyHerdModal, setShowBuyHerdModal] = useState(false);
   const [numOfCowsToBuy, setNumOfCowsToBuy] = useState(2);
-  const handleBuyHerdModalClose = () => setShowBuyHerdModal(false);
+  const handleBuyHerdModalClose = () => undefined;
   const handleBuyHerdModalShow = () => setShowBuyHerdModal(true);
   const handleNumOfCowsToBuyChange = (event) => {
killedBy: ManageCows tests buying a herd of cows
statusReason: Error: expect(received).toBeNull()

Received: <input class="form-control" data-testid="buyHerdForm" min="2" type="number" value="5" />

<html>
  <head />
  <body
    class="modal-open"

[Killed] BooleanLiteral
main/components/Commons/ManageCows.js:9:60
   const [showBuyHerdModal, setShowBuyHerdModal] = useState(false);
   const [numOfCowsToBuy, setNumOfCowsToBuy] = useState(2);
   const handleBuyHerdModalClose = () => setShowBuyHerdModal(false);
-  const handleBuyHerdModalShow = () => setShowBuyHerdModal(true);
+  const handleBuyHerdModalShow = () => setShowBuyHerdModal(false);
   const handleNumOfCowsToBuyChange = (event) => {
     const value = parseInt(event.target.value);
killedBy: ManageCows tests buying a herd of cows
statusReason: Error: Unable to find an element with the text: How many cows do you want to buy?. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] ArrowFunction
main/components/Commons/ManageCows.js:9:34
   const [showBuyHerdModal, setShowBuyHerdModal] = useState(false);
   const [numOfCowsToBuy, setNumOfCowsToBuy] = useState(2);
   const handleBuyHerdModalClose = () => setShowBuyHerdModal(false);
-  const handleBuyHerdModalShow = () => setShowBuyHerdModal(true);
+  const handleBuyHerdModalShow = () => undefined;
   const handleNumOfCowsToBuyChange = (event) => {
     const value = parseInt(event.target.value);
killedBy: ManageCows tests buying a herd of cows
statusReason: Error: Unable to find an element with the text: How many cows do you want to buy?. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="card"
    >
      <h5

[Killed] BlockStatement
main/components/Commons/ManageCows.js:10:49
   const [numOfCowsToBuy, setNumOfCowsToBuy] = useState(2);
   const handleBuyHerdModalClose = () => setShowBuyHerdModal(false);
   const handleBuyHerdModalShow = () => setShowBuyHerdModal(true);
-  const handleNumOfCowsToBuyChange = (event) => {
-    const value = parseInt(event.target.value);
-    if (value >= 2 && !isNaN(value)) {
-      setNumOfCowsToBuy(value);
-    }
-  };
+  const handleNumOfCowsToBuyChange = (event) => {};
   const handleBuyHerd = () => {
     //Stryker disable-next-line all
killedBy: ManageCows tests buying a herd of cows
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "5"
Received: "2"

[Killed] BlockStatement
main/components/Commons/ManageCows.js:12:38
   const handleBuyHerdModalShow = () => setShowBuyHerdModal(true);
   const handleNumOfCowsToBuyChange = (event) => {
     const value = parseInt(event.target.value);
-    if (value >= 2 && !isNaN(value)) {
-      setNumOfCowsToBuy(value);
-    }
+    if (value >= 2 && !isNaN(value)) {}
   };
   const handleBuyHerd = () => {
killedBy: ManageCows tests buying a herd of cows
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "5"
Received: "2"

[Killed] ConditionalExpression
main/components/Commons/ManageCows.js:12:9
   const handleBuyHerdModalShow = () => setShowBuyHerdModal(true);
   const handleNumOfCowsToBuyChange = (event) => {
     const value = parseInt(event.target.value);
-    if (value >= 2 && !isNaN(value)) {
+    if (true) {
       setNumOfCowsToBuy(value);
     }
killedBy: ManageCows tests buying a negative num of cows
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2"
Received: "-2"

[Killed] BlockStatement
main/components/Commons/ManageCows.js:16:31
       setNumOfCowsToBuy(value);
     }
   };
-  const handleBuyHerd = () => {
-    //Stryker disable-next-line all
-    onBuy( numOfCowsToBuy );
-    handleBuyHerdModalClose();
-  };
+  const handleBuyHerd = () => {};
 
   return (
killedBy: ManageCows tests buying a herd of cows
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body

[Killed] OptionalChaining
main/components/Commons/ManageCows.js:26:41
     <Card>
       <Card.Header as="h5">Manage Cows</Card.Header>
       <Card.Body>
-        <Card.Title>Market Cow Price: ${commons?.cowPrice}</Card.Title>
+        <Card.Title>Market Cow Price: ${commons.cowPrice}</Card.Title>
         <Card.Title>Number of Cows: {userCommons.numOfCows}</Card.Title>
         <Row>
killedBy: ManageCows tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'cowPrice')

[Killed] StringLiteral
main/components/Commons/ManageCows.js:38:28
             <Button
               variant="outline-danger"
               onClick={handleBuyHerdModalShow}
-              data-testid={"buy-herd-button"}
+              data-testid={""}
             >
               Buy herd
killedBy: ManageCows tests buying a herd of cows
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="buy-herd-button"]

<body>
  <div>
    <div
      class="card"
    >
      <h5
