[Killed] BlockStatement
main/components/Commons/Profits.js:8:34
 import { timestampToDate } from "main/utils/dateUtils";
 
 
-const Profits = ({ profits }) => {
-    const profitsForTable =
-        profits ?
-        profits.map(profit => ({
-            date: timestampToDate(profit.timestamp),
-            ...profit
-        })) : 
-        // Stryker disable next-line ArrayDeclaration : no need to test what happens if [] is replaced with ["Stryker was here"]
-        [];
-    return (
-        <Card>
-            <Card.Header as="h5">
-                Profits
-            </Card.Header>
-            <Card.Body>
-                {/* change 4am to admin-appointed time? And consider adding milk bottle as decoration */}
-                <Card.Title>
-                    You will earn profits from milking your cows everyday at 4am.
-                </Card.Title>
-                <ProfitsTable profits={profitsForTable} />
-            </Card.Body>
-        </Card>
-    );
-};
+const Profits = ({ profits }) => {};
 
 export default Profits;
killedBy: PlayPage tests click buy and sell buttons
statusReason: Error: Profits(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
