[Killed] ArrowFunction
main/components/Commons/ProfitsTable.js:7:43
 export default function ProfitsTable({ profits }) {
     
     // Stryker disable ArrayDeclaration : [columns] and [students] are performance optimization; mutation preserves correctness
-    const memoizedColumns = React.useMemo(() => 
-        [
-            {
-                Header: "Amount",
-                accessor: (row) => `$${row.amount.toFixed(2)}`,
-            },
-            {
-                Header: "Date",
-                accessor: "date",
-            },
-            {
-                Header: "CowHealth",
-                accessor: "avgCowHealth",
-            },
-            {
-                Header: "NumCows",
-                accessor: "numCows",
-            },
-        ], 
+    const memoizedColumns = React.useMemo(() => undefined, 
     []);
     const memoizedDates = React.useMemo(() => profits, [profits]);
killedBy: Profits tests renders properly for empty profits array
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ObjectLiteral
main/components/Commons/ProfitsTable.js:9:13
     // Stryker disable ArrayDeclaration : [columns] and [students] are performance optimization; mutation preserves correctness
     const memoizedColumns = React.useMemo(() => 
         [
-            {
-                Header: "Amount",
-                accessor: (row) => `$${row.amount.toFixed(2)}`,
-            },
+            {},
             {
                 Header: "Date",
killedBy: Profits tests renders properly for empty profits array
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Commons/ProfitsTable.js:11:27
         [
             {
                 Header: "Amount",
-                accessor: (row) => `$${row.amount.toFixed(2)}`,
+                accessor: () => undefined,
             },
             {
killedBy: Profits tests renders properly when profits is non-empty
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /58.20/
Received:

[Killed] StringLiteral
main/components/Commons/ProfitsTable.js:11:36
         [
             {
                 Header: "Amount",
-                accessor: (row) => `$${row.amount.toFixed(2)}`,
+                accessor: (row) => ``,
             },
             {
killedBy: Profits tests renders properly when profits is non-empty
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  /58.20/
Received:

[Killed] ObjectLiteral
main/components/Commons/ProfitsTable.js:17:13
                 Header: "Date",
                 accessor: "date",
             },
-            {
-                Header: "CowHealth",
-                accessor: "avgCowHealth",
-            },
+            {},
             {
                 Header: "NumCows",
killedBy: ProfitsTable tests renders without crashing for 0 profits
statusReason: Error: A column ID (or string accessor) is required!
