[Killed] ObjectLiteral
main/components/Users/UsersTable.js:10:5
         Header: 'id',
         accessor: 'id', // accessor is the "key" in the data
     },
-    {
-        Header: 'First Name',
-        accessor: 'givenName',
-    },
+    {},
     {
         Header: 'Last Name',
killedBy: UserTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Users/UsersTable.js:22:5
         Header: 'Email',
         accessor: 'email',
     },
-    {
-        Header: 'Last Online',
-        accessor: 'lastOnline',
-    },
+    {},
     {
         Header: 'Admin',
killedBy: UserTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Users/UsersTable.js:24:19
     },
     {
         Header: 'Last Online',
-        accessor: 'lastOnline',
+        accessor: "",
     },
     {
killedBy: UserTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-lastOnline"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white;"

[Killed] BlockStatement
main/components/Users/UsersTable.js:33:47
     },
 ];
 
-export default function UsersTable({ users }) {
-    const data = useMemo(
-        () =>
-            (users || []).map((user) => ({
-                ...user,
-                lastOnline: formatTime(user.lastOnline),
-            })),
-        // Stryker disable next-line all
-        [users]
-    );
-
-    return <OurTable
-        data={data}
-        columns={columns}
-        testid={"UsersTable"} />;
-};
+export default function UsersTable({ users }) {};
killedBy: UserTable tests renders without crashing for empty table
statusReason: Error: UsersTable(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ArrowFunction
main/components/Users/UsersTable.js:35:9
 
 export default function UsersTable({ users }) {
     const data = useMemo(
-        () =>
-            (users || []).map((user) => ({
-                ...user,
-                lastOnline: formatTime(user.lastOnline),
-            })),
+        () => undefined,
         // Stryker disable next-line all
         [users]
killedBy: UserTable tests renders without crashing for empty table
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')

[Killed] ArrowFunction
main/components/Users/UsersTable.js:36:31
 export default function UsersTable({ users }) {
     const data = useMemo(
         () =>
-            (users || []).map((user) => ({
-                ...user,
-                lastOnline: formatTime(user.lastOnline),
-            })),
+            (users || []).map(() => undefined),
         // Stryker disable next-line all
         [users]
killedBy: UserTable tests renders without crashing for three users
statusReason: TypeError: Cannot read properties of undefined (reading 'subRows')

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:36:14
 export default function UsersTable({ users }) {
     const data = useMemo(
         () =>
-            (users || []).map((user) => ({
+            (true).map((user) => ({
                 ...user,
                 lastOnline: formatTime(user.lastOnline),
killedBy: UserTable tests renders without crashing for empty table
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value).map is not a function
