[Killed] ArrowFunction
src/main/pages/AdminEditCommonsPage.js:25:34
     );
 
 
-  const objectToAxiosPutParams = (commons) => ({
-    url: "/api/commons/update",
-    method: "PUT",
-    params: {
-      id: commons.id,
-    },
-    data: {
-        "name": commons.name,
-        "startingBalance": commons.startingBalance,
-        "cowPrice": commons.cowPrice,
-        "milkPrice": commons.milkPrice,
-        "startingDate": commons.startingDate,
-        "degradationRate": commons.degradationRate,
-        "carryingCapacity": commons.carryingCapacity,
-        "showLeaderboard": commons.showLeaderboard,
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (_, commons) => {
killedBy: AdminEditCommonsPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/main/pages/AdminEditCommonsPage.js:25:48
     );
 
 
-  const objectToAxiosPutParams = (commons) => ({
-    url: "/api/commons/update",
-    method: "PUT",
-    params: {
-      id: commons.id,
-    },
-    data: {
-        "name": commons.name,
-        "startingBalance": commons.startingBalance,
-        "cowPrice": commons.cowPrice,
-        "milkPrice": commons.milkPrice,
-        "startingDate": commons.startingDate,
-        "degradationRate": commons.degradationRate,
-        "carryingCapacity": commons.carryingCapacity,
-        "showLeaderboard": commons.showLeaderboard,
-    }
-  });
+  const objectToAxiosPutParams = (commons) => ({});
 
   const onSuccess = (_, commons) => {
killedBy: AdminEditCommonsPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
src/main/pages/AdminEditCommonsPage.js:68:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit  Commons</h1>
-        {commons &&
-          <CommonsForm initialCommons={commons} submitAction={submitAction} buttonLabel="Update" />
+        {false
         }
       </div>
killedBy: AdminEditCommonsPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find a label with the text of: /Commons Name/

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
