[Killed] ArrowFunction
src/main/pages/AdminJobsPage.js:17:40
 
     const refreshJobsIntervalMilliseconds = 5000;
 
-    const objectToAxiosParamsTestJob = (data) => ({
-        url: `/api/jobs/launch/testjob?fail=${data.fail}&sleepMs=${data.sleepMs}`,
-        method: "POST"
-    });
+    const objectToAxiosParamsTestJob = () => undefined;
 
     // Stryker disable all
killedBy: AdminJobsPage tests user can submit a test job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
src/main/pages/AdminJobsPage.js:17:51
 
     const refreshJobsIntervalMilliseconds = 5000;
 
-    const objectToAxiosParamsTestJob = (data) => ({
-        url: `/api/jobs/launch/testjob?fail=${data.fail}&sleepMs=${data.sleepMs}`,
-        method: "POST"
-    });
+    const objectToAxiosParamsTestJob = (data) => ({});
 
     // Stryker disable all
killedBy: AdminJobsPage tests user can submit a test job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
src/main/pages/AdminJobsPage.js:19:17
 
     const objectToAxiosParamsTestJob = (data) => ({
         url: `/api/jobs/launch/testjob?fail=${data.fail}&sleepMs=${data.sleepMs}`,
-        method: "POST"
+        method: ""
     });
 
killedBy: AdminJobsPage tests user can submit a test job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
