[Killed] BlockStatement
main/components/Jobs/InstructorReportForm.js:1:33
-function InstructorReportForm() {
-    return (
-      <p>This will be the Instructor Report Function (coming soon)</p>
-    );
-  }
+function InstructorReportForm() {}
   
   export default InstructorReportForm;
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: InstructorReportForm(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
