[Killed] StringLiteral
main/components/Leaderboard/LeaderboardTable.js:36:21
 
     const columnsIfAdmin = [
         {
-            Header: '(Admin) userCommons Id',
+            Header: "",
             accessor: 'id'
         },
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: (Admin) userCommons Id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white;"
