[Killed] BlockStatement
main/components/Utils/Plaintext.js:3:43
 // based in part on this SO answer: https://codereview.stackexchange.com/a/211511
 
-export default function Plaintext({text}) {
-  if (text==null) {
-    return (<pre data-testid="plaintext-empty"></pre>)
-  }
-  const textToRender = typeof text === "string" ? text : JSON.stringify(text, null, 2);
-  const [firstLine, ...rest] = textToRender.split('\n')
-  return (
-    <pre data-testid="plaintext">
-      <span>{ firstLine }</span>
-      {
-        rest.map((line) => (
-          <>
-            <br />
-            <span>{ line }</span>
-          </>
-        ))
-      }
-    </pre>
-  );
-}
+export default function Plaintext({text}) {}
killedBy: JobsTable tests Has the expected column headers and content
statusReason: Error: Plaintext(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] EqualityOperator
main/components/Utils/Plaintext.js:4:7
 // based in part on this SO answer: https://codereview.stackexchange.com/a/211511
 
 export default function Plaintext({text}) {
-  if (text==null) {
+  if (text != null) {
     return (<pre data-testid="plaintext-empty"></pre>)
   }
killedBy: Plaintext tests renders the correct text
statusReason: Error: Unable to find an element with the text: foo. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <pre
      data-testid="plaintext-empty"
    />
  </div>

[Killed] BlockStatement
main/components/Utils/Plaintext.js:4:19
 // based in part on this SO answer: https://codereview.stackexchange.com/a/211511
 
 export default function Plaintext({text}) {
-  if (text==null) {
-    return (<pre data-testid="plaintext-empty"></pre>)
-  }
+  if (text==null) {}
   const textToRender = typeof text === "string" ? text : JSON.stringify(text, null, 2);
   const [firstLine, ...rest] = textToRender.split('\n')
killedBy: Plaintext tests works on null parameter
statusReason: Error: Unable to find an element by: [data-testid="plaintext-empty"]

<body>
  <div>
    <pre
      data-testid="plaintext"
    >
      <span>

[Killed] ConditionalExpression
main/components/Utils/Plaintext.js:7:24
   if (text==null) {
     return (<pre data-testid="plaintext-empty"></pre>)
   }
-  const textToRender = typeof text === "string" ? text : JSON.stringify(text, null, 2);
+  const textToRender = true ? text : JSON.stringify(text, null, 2);
   const [firstLine, ...rest] = textToRender.split('\n')
   return (
killedBy: Plaintext tests works on non-text types
statusReason: TypeError: textToRender.split is not a function or its return value is not iterable

[Killed] ArrowFunction
main/components/Utils/Plaintext.js:13:18
     <pre data-testid="plaintext">
       <span>{ firstLine }</span>
       {
-        rest.map((line) => (
-          <>
-            <br />
-            <span>{ line }</span>
-          </>
-        ))
+        rest.map(() => undefined)
       }
     </pre>
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Hello World! from test job!Goodbye from test job!
Received:
  Hello World! from test job!
