[Killed] LogicalOperator
src/main/pages/ProfilePage.js:38:14
                     <RoleBadge role={"ROLE_ADMIN"} currentUser={currentUser} />
                 </Col>
             </Row>
-            {commons && <Row className="align-items-center profile-header mb-5 text-center text-md-left">
-                {commons.map((common) => (
-                    <CommonsCardBox key={common.id} commons={common} />
-                ))}
-            </Row>}
+            {commons || <Row className="align-items-center profile-header mb-5 text-center text-md-left">
+                {commons.map(common => <CommonsCardBox key={common.id} commons={common} />)}
+            </Row>}
             <Row className="text-left">
                 <ReactJson src={currentUser.root} />
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, name, cowPrice, milkPrice}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
src/main/pages/ProfilePage.js:38:14
                     <RoleBadge role={"ROLE_ADMIN"} currentUser={currentUser} />
                 </Col>
             </Row>
-            {commons && <Row className="align-items-center profile-header mb-5 text-center text-md-left">
-                {commons.map((common) => (
-                    <CommonsCardBox key={common.id} commons={common} />
-                ))}
-            </Row>}
+            {true}
             <Row className="text-left">
                 <ReactJson src={currentUser.root} />
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: TestingLibraryElementError: Unable to find an element with the text: MyCommon. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
src/main/pages/ProfilePage.js:39:30
                 </Col>
             </Row>
             {commons && <Row className="align-items-center profile-header mb-5 text-center text-md-left">
-                {commons.map((common) => (
-                    <CommonsCardBox key={common.id} commons={common} />
-                ))}
+                {commons.map(() => undefined)}
             </Row>}
             <Row className="text-left">
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: TestingLibraryElementError: Unable to find an element with the text: MyCommon. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
