[Killed] ConditionalExpression
src/main/utils/dateUtils.js:15:9
 const weekInSeconds = 7 * dayInSeconds;
 
 export function formatTime(timeString) {
-    if (!timeString) {
+    if (false) {
         return "";
     }
killedBy: dateUtils tests formatTime tests should return empty string for null input
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ""
Received: "12/31/1969"

[Killed] ConditionalExpression
src/main/utils/dateUtils.js:23:9
     const dateFromEpoch = new Date(timeString);
     const secondsPast = Math.floor((now - dateFromEpoch) / 1000);
 
-    if (secondsPast < minutesInSeconds * 2) {
+    if (false) {
         return 'Online now';
     }
killedBy: dateUtils tests formatTime tests should return `Online now` for less than 2 minutes
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "Online now"
Received: "1 minutes ago"

[Killed] EqualityOperator
src/main/utils/dateUtils.js:27:9
         return 'Online now';
     }
 
-    if (secondsPast < hourInSeconds) {
+    if (secondsPast <= hourInSeconds) {
         const minutes = Math.floor(secondsPast / 60);
         return `${minutes} minutes ago`;
killedBy: dateUtils tests formatTime tests should return 1 hour ago for 1 hour
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "1 hour ago"
Received: "60 minutes ago"

[Killed] EqualityOperator
src/main/utils/dateUtils.js:27:9
         return 'Online now';
     }
 
-    if (secondsPast < hourInSeconds) {
+    if (secondsPast >= hourInSeconds) {
         const minutes = Math.floor(secondsPast / 60);
         return `${minutes} minutes ago`;
killedBy: dateUtils tests formatTime tests should return minutes ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 minutes ago"
Received: "0 hour ago"

[Killed] BlockStatement
src/main/utils/dateUtils.js:37:38
         return `${hours} hour${hours > 1 ? 's' : ''} ago`;
     }
     
-    if (secondsPast < weekInSeconds) {
-        const days = Math.floor(secondsPast / 86400);
-        return `${days} day${days > 1 ? 's' : ''} ago`;
-    }
+    if (secondsPast < weekInSeconds) {}
 
     return dateFromEpoch.toLocaleDateString();
killedBy: dateUtils tests formatTime tests should return days ago format
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "2 days ago"
Received: "6/3/2023"

[Killed] ConditionalExpression
src/main/utils/dateUtils.js:37:9
         return `${hours} hour${hours > 1 ? 's' : ''} ago`;
     }
     
-    if (secondsPast < weekInSeconds) {
+    if (true) {
         const days = Math.floor(secondsPast / 86400);
         return `${days} day${days > 1 ? 's' : ''} ago`;
killedBy: dateUtils tests formatTime tests should return date string for over a week
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "5/29/2023"
Received: "7 days ago"
