[Killed] ObjectLiteral
main/components/Leaderboard/LeaderboardTable.js:32:9
             Header: 'Total Cows Bought',
             accessor: 'lifetimeCowsBought',
         }, 
-        {
-            Header: 'Total Cows Sold', 
-            accessor: 'lifetimeCowsSold',
-        },
+        {},
     ];
 
killedBy: LeaderboardTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!
